# 1. 내장함수 abs() 함수를 사용하여 abs(-3) + abs(5)의 값을 변수 a에 할당하세요. 
# 2. 내장함수 round()함수를 사용하여 round(4.7)+round(2.2)의 값을 변수 b에 할당하세요. 
# 3. 내장함수 max(), min()함수를 사용하여 max([1,3,5,4,2]) + min([1,3,5,4,2])의 값을 변수 c에 할당하세요.
# 4. 내장함수 sum() 함수를 사용하여 sum([2,4,3,1,5])의 값을 변수d에 할당하세요. 
# 5. 마지막으로 변수 a,b,c,d를 모두 더한 값을 화면에 출력하세요 


# 1
a = abs(-3) + abs(5)
print(a)

# 2
b = round(4.7) + round(2.2) 
print(b)

# 3

c = max([1,3,5,4,2]) + min([1,3,5,4,2])
print(c)

# 4
d = sum([2,4,3,1,5])
print(d)

# 5
print(a+b+c+d)